In [141]:
## import libraries

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [165]:
## generate dataframe

df = pd.DataFrame({'a':[1,2,3],
                   'b':[4,5,6],
                   'c':[7,8,9]},
                   index = [1,2,3])

df

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [143]:
df1 = pd.DataFrame([[1,4,7],
                    [2,5,8],
                    [3,6,9]],
                    index = [1,2,3],
                    columns = ['a','b','c'])
df1

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [144]:
## Multi index

dfMultiIndex = pd.DataFrame({'a':[1,2,3],
                             'b':[4,5,6],
                             'c':[7,8,9]},
                             index =pd.MultiIndex.from_tuples([('d',1),('d',2), ('e',2)],
                                                              names = ['x1','x2']))
dfMultiIndex

       a  b  c
x1 x2
d  1   1  4  7
   2   2  5  8
e  2   3  6  9

In [145]:
## loc 

df.loc[:3,['a','b','c']]

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [146]:
## iloc

df.iloc[2,0:3]

a    3
b    6
c    9
Name: 3, dtype: int64

In [147]:
dfMultiIndex

       a  b  c
x1 x2
d  1   1  4  7
   2   2  5  8
e  2   3  6  9

In [148]:

dfMultiIndex.loc[('e',2),('b','c')]

b    6
c    9
Name: (e, 2), dtype: int64

In [149]:
dfMultiIndex.iloc[1,1:3]

b    5
c    8
Name: (d, 2), dtype: int64

In [150]:
## concatenate
df_concat=pd.concat([df,df])

In [151]:
df_concat

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9
1  1  4  7
2  2  5  8
3  3  6  9

In [152]:
pd.concat([df,df],axis=1)

   a  b  c  a  b  c
1  1  4  7  1  4  7
2  2  5  8  2  5  8
3  3  6  9  3  6  9

In [153]:
## sort

df.sort_values('c', ascending=False)

   a  b  c
3  3  6  9
2  2  5  8
1  1  4  7

In [154]:
df.sort_values(1, axis = 1, ascending=False)

   c  b  a
1  7  4  1
2  8  5  2
3  9  6  3

In [155]:
##to delete rows or columns DROP

df_new = df.drop(columns ='c')
df_new

   a  b
1  1  4
2  2  5
3  3  6

In [156]:
##to delete rows or columns DROP and then in place

df_new = df.drop(columns ='c', inplace=True)

In [157]:
df

   a  b
1  1  4
2  2  5
3  3  6

In [158]:
df.drop([1,3], inplace=True)

In [159]:
df

   a  b
2  2  5

In [160]:
## create new dataframe

new_df = pd.DataFrame({'col1':[11,11,12,12],
                       'col2':['a','a','b','b']})
new_df

   col1 col2
0    11    a
1    11    a
2    12    b
3    12    b

In [161]:
##drop duplicate

new_df_index = new_df.drop_duplicates()
new_df_index

   col1 col2
0    11    a
2    12    b

In [162]:
# reset the index
new_df_index = new_df_index.reset_index()
new_df_index

   index  col1 col2
0      0    11    a
1      2    12    b

In [163]:
new_df_with_index = new_df_index.reset_index(drop=True)
new_df_with_index

   index  col1 col2
0      0    11    a
1      2    12    b

In [166]:
## head
df.head()

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [167]:
# tail

df.tail(100)

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [170]:
## sample

df.sample(2)

   a  b  c
1  1  4  7
2  2  5  8

In [171]:
# largest 

df.nlargest(2,'b')

   a  b  c
3  3  6  9
2  2  5  8

In [172]:
# smallest
df.nsmallest(2,'b')

   a  b  c
1  1  4  7
2  2  5  8

In [173]:
## transpose

df.T

   1  2  3
a  1  2  3
b  4  5  6
c  7  8  9

In [174]:
## code describe
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0